// 📝 Завдання 1

// Створи змінні:

// let firstName = "Іван";
// let lastName = "Петренко";

// З’єднай їх так, щоб у консолі вийшло:

// Іван Петренко

// let fullName = firstName + " " + lastName;
// console.log(fullName);

// 📝 Завдання 2

// Є змінні:

// let city = "Львів";
// let country = "Україна";
// country = "Україні";

// Виведи у консоль рядок:

// Місто Львів знаходиться в Україні

// let info = `Місто ${city} знаходиться в ${country}`;
// console.log(info);

// 📝 Завдання 3

// Створи змінні:

// let product = "Хліб";
// let price = 20;

// Виведи у консоль:

// Ціна товару Хліб — 20 грн

// let breadPrice = `Ціна товару ${product} — ${price} грн`;
// console.log(breadPrice);

// 📝 Завдання 4

// Є змінні:

// let word1 = "Java";
// let word2 = "Script";

// Зроби так, щоб у консоль виводилось:

// JavaScript

// let wordComb = word1 + word2;
// console.log(wordComb);

// 📝 Завдання 5

// Є змінні:

// let greeting = "Привіт";
// let name = "Олег";

// Зроби так, щоб у консолі було:

// Привіт, Олег!

// let personalGreeting = greeting + ", " + name + "!";
// console.log(personalGreeting);

//=====================================================

// Магазин з продажу ремонтних дроїдів готовий до відкриття,
//     залишилося написати скрипт для їх замовлення.
// Оголоси змінні та присвой їм відповідні значення:

// pricePerDroid - ціна одного дроїда, значення 800
// orderedQuantity - кількість дроїдів у замовленні, значення 6
// deliveryFee - вартість доставки, значення 50
// totalPrice - загальна сума замовлення до сплати
// (ціна одного дроїда помножена на кількість дроїдів у замовленні, плюс вартість доставки)
// message - повідомлення про стан замовлення у форматі "You ordered droids worth <total price> credits"
// Оголошена змінна orderedQuantity
// Значення змінної orderedQuantity - це число 6
// Оголошена змінна pricePerDroid
// Значення змінної pricePerDroid - це число 800
// Оголошена змінна deliveryFee
// Значення змінної deliveryFee - це число 50
// Оголошена змінна totalPrice
// Значення змінної totalPrice - це число 4850
// Оголошена змінна message
// Значення змінної message - це рядок "You ordered droids worth 4850 credits"

// let pricePerDroid = 800;
// let orderedQuantity = 6;
// let deliveryFee = 50;
// let totalPrice = pricePerDroid * orderedQuantity + deliveryFee;
// let message = `You ordered droids worth ${totalPrice} credits`;
// console.log(message);

//===========================Довжина рядка============================

// Змінна username зберігає рядок з іменем користувача.
// Оголоси змінну message та за допомогою синтаксису шаблонних рядків доповни код так,
// щоб в ній зберігався рядок наступного формату: "Username <name> is <length> characters long",
// в якому < name > це ім'я користувача зі змінної username, а <length> це його довжина.

// Оголошена змінна username
// Оголошена змінна message
// Якщо значення username це "Poly", значення message буде "Username Poly is 4 characters long"
// Якщо значення username це "Harambe", значення message буде "Username Harambe is 7 characters long"
// Якщо значення username це "Billy", значення message буде "Username Billy is 5 characters long"
// Якщо значення username це "Joe", значення message буде "Username Joe is 3 characters long"
// Використовується синтаксис шаблонних рядків

// let username = "Poly";
// username = "Harambe";
// username = "Billy";
// username = "Joe";

// username.length;
// const length = username.length;

// const message = `Username ${username} is ${length} characters long`;
// console.log(message);

//=========================================================

// 📝 Практичні завдання (початковий рівень)
// Завдання 1

// Створи змінну:

// let word = "JavaScript";

// Виведи у консоль довжину рядка.

// console.log(word.length);

// Завдання 2
// let name = "Павло Юрійович";

// Виведи в консоль довжину цього рядка.

// console.log(name.length);

// Завдання 3
// let sentence = "Я вивчаю JavaScript";

// Знайди кількість символів у цьому рядку.

// console.log(sentence.length);

// Завдання 4

// Створи рядок з одним пробілом " " і виведи його довжину.

// console.log(" ".length);
// console.log("Be happy".length);

// Завдання 5 ⭐ (трошки цікавіше)

// Є рядок:

// let password = "12345qwerty";

// Перевір, чи довжина пароля більша або дорівнює 8 символів.
// Якщо так — виведи "Пароль достатньо довгий", інакше — "Пароль занадто короткий".

// function checkPassword(password) {
//   if (password.length >= 8) {
//     return "Пароль достатньо довгий";
//   } else {
//     return "Пароль занадто короткий";
//   }
// }

// console.log(checkPassword("12345qwerty"));
// console.log(checkPassword("12345"));

//====================Індексація рядків===============

// 📝 Практичні завдання(початковий рівень)

// Завдання 1
// let word = "JavaScript";

// Виведи перший і останній символ цього слова.

// console.log(word[0]);

// const lastElementIndex = word.length - 1;
// console.log(word[lastElementIndex]);

// console.log(word[word.length - 1]);

// Завдання 2
// let name = "Павло";

// Виведи другий і четвертий символ.

// console.log(name[1]);
// console.log(name[3]);

// Завдання 3
// let sentence = "Я вивчаю JS";

// Виведи символи з індексами 0, 3 і 6.

// console.log(sentence[0]);
// console.log(sentence[3]);
// console.log(sentence[6]);

//===================================================

// Створи змінну:

// let word = "Frontend";

// Виведи перший і останній символ.

// console.log(word[0]);
// console.log(word[word.length - 1]);

// Створи змінну:

// let name = "Олена";

// Виведи другий і четвертий символ.

// console.log(name[1]);
// console.log(name[3]);

// Створи змінну:

// let sentence = "JS is fun";

// Виведи символи з індексами 0, 3, 5.

// console.log(sentence[0]);
// console.log(sentence[5]);
// console.log(sentence[3]);

// Створи змінну:

// let city = "Київ";

// Виведи перший символ і довжину рядка одночасно.
// console.log(city[0], city.length);

//=======================================================
