// 🟢 Завдання 1 — Сума чисел

// Опис:
// Знайди суму всіх чисел у масиві.

const numbers1 = [4, 7, 2, 9];

const sumNum = numbers1.reduce((sum, num) => sum + num, 0);
console.log(sumNum);

// ✅ Очікуваний результат: 22

// ===================================================

// 🟢 Завдання 2 — Множення всіх елементів

// Опис:
// Знайди добуток (результат множення) усіх чисел у масиві.

const numbers2 = [2, 3, 4];
const multiplyNumbers = numbers2.reduce((res, num) => res * num, 1);
console.log(multiplyNumbers);

// ✅ Очікуваний результат: 24

// ===================================================

// 🟡 Завдання 3 — Найбільше число

// Опис:
// Визнач, яке число найбільше у масиві.

const numbers3 = [5, 12, 8, 3, 20, 7];
const numbers = [5, 10, 3, 8, 2];

// const max = numbers.reduce((acc, curr) => {
//   if (curr > acc) {
//     // якщо поточний елемент більший за накопичувач, оновлюємо його
//     return curr;
//   } else {
//     // інакше залишаємо накопичувач без змін
//     return acc;
//   }
// }, numbers[0]);

// або

const max = numbers.reduce(
  (acc, curr) => (curr > acc ? curr : acc),
  numbers[0]
);

console.log(max); // 10

// ✅ Очікуваний результат: 20

// ===================================================

// 🟠 Завдання 4 — Підрахунок повторень

// Опис:
// Створи об’єкт, де вказано, скільки разів кожне слово зустрічається в масиві.

const fruits = ["apple", "banana", "apple", "orange", "banana", "apple"];

// ✅ Очікуваний результат:

const result = fruits.reduce((acc, fruit) => {
  if (acc[fruit]) {
    acc[fruit] += 1; // якщо слово вже є, додаємо 1
  } else {
    acc[fruit] = 1; // якщо слова ще немає, створюємо ключ зі значенням 1
  }
  return acc; // повертаємо накопичувач для наступної ітерації
}, {}); // початковий об’єкт порожній

console.log(result);

// { apple: 3, banana: 2, orange: 1 }

// ===================================================

// 🔴 Завдання 5 — Об’єднання масиву об’єктів

// Опис:
// Є масив об’єктів з покупками. Потрібно знайти загальну суму вартості.

const cart = [
  { name: "apple", price: 10 },
  { name: "banana", price: 8 },
  { name: "orange", price: 15 },
];

const totalPrice = cart.reduce((acc, item) => acc + item.price, 0);
console.log(totalPrice);

// ✅ Очікуваний результат: 33

// ===================================================
